#+TITLE: GTD System User Guide - Complete Reference
#+AUTHOR: Rod Knowlton
#+DATE: 2025-01-09
#+OPTIONS: toc:4 num:t

* Introduction

This comprehensive guide documents every feature of your Getting Things Done (GTD) implementation in Spacemacs. Use it as a reference manual for all commands, configurations, and workflows.

** System Overview

Your GTD system implements David Allen's methodology with these core components:

- *Capture*: Quick entry for any input
- *Clarify*: Process items to determine actions
- *Organize*: File by context and project
- *Review*: Keep system current and trusted
- *Engage*: Do the work with confidence

** Architecture

The system uses a context-aware architecture:
- Separate work and personal contexts
- Unified view when needed
- Smart filing and organization
- Integrated with org-roam knowledge base

* File Structure

** Directory Layout

#+BEGIN_EXAMPLE
~/personal/org-files/
├── inbox.org              # Universal capture point
├── archive.org            # Completed items archive
├── work/
│   ├── gtd.org           # Work next actions and tasks
│   ├── projects.org      # Work projects
│   └── someday.org       # Work someday/maybe items
└── personal/
    ├── gtd.org           # Personal next actions and tasks  
    ├── projects.org      # Personal projects
    └── someday.org       # Personal someday/maybe items
#+END_EXAMPLE

** File Purposes

| File         | Purpose                           | What Goes Here           |
|--------------+-----------------------------------+--------------------------|
| inbox.org    | Temporary holding                 | Everything initially     |
| gtd.org      | Active tasks                      | Next actions, todos      |
| projects.org | Multi-step outcomes               | Projects with subtasks   |
| someday.org  | Future possibilities              | Not committed yet        |
| archive.org  | Completed items                   | Done/cancelled tasks     |

* Complete Keybinding Reference

** Main GTD Prefix: SPC o o

All GTD commands start with =SPC o o= (org-org).

** Capture Commands (SPC o o c)

| Keybinding   | Command                    | Description                          |
|--------------+----------------------------+--------------------------------------|
| SPC o o c    | org-capture                | Open capture menu                    |
| SPC o o c i  | Inbox capture              | Quick capture to inbox               |
| SPC o o c t  | Context task               | Task to current context              |
| SPC o o c n  | Quick note                 | Immediate note (no confirm)          |
| SPC o o c p  | Project capture            | New project with template            |
| SPC o o c m  | Meeting capture            | Meeting with attendees               |
| SPC o o c w  | Work task                  | Direct to work (unified mode)        |
| SPC o o c W  | Work project               | Work project (unified mode)          |
| SPC o o c p  | Personal task              | Direct to personal (unified mode)    |
| SPC o o c P  | Personal project           | Personal project (unified mode)      |
| SPC o o c x  | Advanced captures          | Additional template menu             |
| SPC o o c x i| Interruption log           | Track interruption with clock        |
| SPC o o c x e| Email task                 | Task from email                      |
| SPC o o c x v| Voice note                 | Placeholder for audio capture        |
| SPC o o c x r| Reading list               | Books/articles to read               |
| SPC o o c x h| Habit                      | Recurring habit tracker              |
| SPC o o c x p| Process inbox              | Enter inbox processing mode          |
| SPC o o c e l| Low energy task            | Quick capture for tired times        |
| SPC o o c e h| High energy task           | Capture for peak performance         |

** Agenda Commands (SPC o o a)

| Keybinding   | Command                    | Description                          |
|--------------+----------------------------+--------------------------------------|
| SPC o o a    | org-agenda                 | Main agenda dispatcher               |
| SPC o o a w  | Work dashboard             | Work-only view                       |
| SPC o o a p  | Personal dashboard         | Personal-only view                   |
| SPC o o a u  | Unified dashboard          | Combined work+personal               |
| SPC o o a f  | Focus mode                 | Top 3 next actions                   |
| SPC o o a i  | Inbox processing           | Show inbox with actions              |
| SPC o o a e  | Energy views menu          | Energy-based task lists              |
| SPC o o a e l| Low energy tasks           | Tasks for low energy                 |
| SPC o o a e h| High energy tasks          | Tasks needing focus                  |
| SPC o o a s  | Stalled items              | Tasks/projects with no progress      |
| SPC o o a P  | Project overview           | All projects summary                 |
| SPC o o a c  | Context views menu         | Location-based views                 |
| SPC o o a c w| @work context              | Tasks for work location              |
| SPC o o a c h| @home context              | Tasks for home                       |
| SPC o o a c c| @computer context          | Computer-based tasks                 |
| SPC o o a c p| @phone context             | Calls to make                        |
| SPC o o a c e| @errands context           | Out and about tasks                  |
| SPC o o a t  | Time-based views           | Views by time estimate               |
| SPC o o a t q| Quick tasks                | 5-15 minute tasks                    |
| SPC o o a t d| Deep work                  | Extended focus tasks                 |

** File Navigation (SPC o o g)

| Keybinding   | Command                    | Description                          |
|--------------+----------------------------+--------------------------------------|
| SPC o o g i  | Go to inbox                | Open inbox.org                       |
| SPC o o g a  | Go to archive              | Open archive.org                     |
| SPC o o g g  | Go to GTD                  | Context-aware gtd.org                |
| SPC o o g p  | Go to projects             | Context-aware projects.org           |
| SPC o o g w  | Go to work GTD             | work/gtd.org                         |
| SPC o o g W  | Go to work projects        | work/projects.org                    |
| SPC o o g P  | Go to personal projects    | personal/projects.org                |
| SPC o o g t  | Go to tutorial             | Open this tutorial                   |
| SPC o o g u  | Go to user guide           | Open user guide                      |

** Mode Switching (SPC o o m)

| Keybinding   | Command                    | Description                          |
|--------------+----------------------------+--------------------------------------|
| SPC o o m w  | Work mode                  | Show only work items                 |
| SPC o o m p  | Personal mode              | Show only personal items             |
| SPC o o m u  | Unified mode               | Show everything                      |
| SPC o o m m  | Mode hydra                 | Interactive mode switcher            |

** Refile Commands (SPC o o r)

| Keybinding   | Command                    | Description                          |
|--------------+----------------------------+--------------------------------------|
| SPC o o r    | org-refile                 | Standard refile                      |
| SPC o o r r  | Refile hydra               | Quick refile menu                    |
| SPC o o r w  | Refile to work             | Quick work GTD refile                |
| SPC o o r p  | Refile to personal         | Quick personal GTD refile            |
| SPC o o r c  | Refile to clock            | Refile to current clocked task       |
| SPC o o r a  | Archive subtree            | Move to archive                      |

** Clock Commands (SPC o o k)

| Keybinding   | Command                    | Description                          |
|--------------+----------------------------+--------------------------------------|
| SPC o o k i  | Clock in                   | Start timing                         |
| SPC o o k o  | Clock out                  | Stop timing                          |
| SPC o o k j  | Jump to clock              | Go to clocked task                   |
| SPC o o k l  | Clock in last              | Resume last clocked                  |
| SPC o o k r  | Clock report               | Show time report                     |
| SPC o o k d  | Display time               | Show time in buffer                  |
| SPC o o k p  | Pomodoro                   | Start pomodoro timer                 |
| SPC o o k h  | Clock hydra                | Clock management menu                |

** Review Commands (SPC o o R)

| Keybinding   | Command                    | Description                          |
|--------------+----------------------------+--------------------------------------|
| SPC o o R w  | Weekly review              | Comprehensive weekly review          |
| SPC o o R d  | Daily review               | Quick daily review                   |
| SPC o o R p  | Process inbox              | Focused inbox processing             |
| SPC o o R s  | Review stalled             | Check stalled projects               |

** Archive Commands (SPC o o A)

| Keybinding   | Command                    | Description                          |
|--------------+----------------------------+--------------------------------------|
| SPC o o A a  | Archive subtree            | Archive current task                 |
| SPC o o A d  | Archive done tasks         | Bulk archive completed               |
| SPC o o A o  | Archive old tasks          | Archive 30+ day old done             |
| SPC o o A f  | Go to archive file         | Open archive.org                     |

** Extension Commands (SPC o o x)

| Keybinding   | Command                    | Description                          |
|--------------+----------------------------+--------------------------------------|
| SPC o o x t  | Tangle config              | Regenerate from .org                 |
| SPC o o x r  | Reload config              | Reload codelahoma-org                |
| SPC o o x c  | Advanced captures          | Extended capture templates           |
| SPC o o x p  | Process inbox              | Inbox processing mode                |

** Help Commands (SPC o o h)

| Keybinding   | Command                    | Description                          |
|--------------+----------------------------+--------------------------------------|
| SPC o o h    | GTD cheatsheet             | Show quick reference                 |
| SPC o o ?    | GTD cheatsheet             | Same as above                        |

* TODO States and Workflow

** TODO Keywords

| State     | Key | Meaning                        | Next States        |
|-----------+-----+--------------------------------+--------------------|
| NEXT      | n   | Next action to work on         | TODO, DONE, CANCELLED |
| TODO      | t   | Future action                  | NEXT, DONE, CANCELLED |
| WAITING   | w   | Blocked/delegated              | TODO, DONE, CANCELLED |
| DONE      | d   | Completed                      | Archive            |
| CANCELLED | c   | No longer needed               | Archive            |
| PROJECT   | p   | Multi-step outcome             | DONE, CANCELLED    |
| SOMEDAY   | s   | Maybe later                    | TODO, CANCELLED    |

** State Transitions

#+BEGIN_SRC ditaa
    +------+     +------+     +---------+
    | NEXT |---->| DONE |---->| ARCHIVE |
    +------+     +------+     +---------+
       |            ^              ^
       v            |              |
    +------+        |              |
    | TODO |--------+              |
    +------+                       |
       |                           |
       v                           |
    +---------+     +-----------+  |
    | WAITING |---->| CANCELLED |--+
    +---------+     +-----------+
#+END_SRC

** Automatic State Management

- WAITING items automatically get =:WAITING:= tag
- CANCELLED items get =:CANCELLED:= tag  
- State changes are logged with timestamps
- DONE items record =CLOSED:= timestamp

* Tag System

** Context Tags

*** Location Contexts
| Tag        | Key | Usage                     | Example Tasks              |
|------------+-----+---------------------------+----------------------------|
| @work      | w   | Work location/mindset     | Email boss, review code    |
| @home      | h   | Home location             | Fix leaky faucet           |
| @office    | o   | Physical office           | Print documents            |
| @phone     | c   | Phone calls needed        | Call dentist               |
| @computer  | m   | Requires computer         | Update spreadsheet         |
| @errands   | e   | Out and about             | Buy groceries              |

*** Energy Contexts  
| Tag          | Key | Usage                   | Best Time                  |
|--------------+-----+-------------------------+----------------------------|
| @high_energy | H   | Needs mental focus      | Morning, after coffee      |
| @low_energy  | L   | Routine/mechanical      | Afternoon slump            |
| @creative    | C   | Creative thinking       | When inspired              |
| @routine     | R   | Standard procedures     | Anytime                    |

*** Time Contexts
| Tag     | Key | Duration  | Example Tasks                    |
|---------+-----+-----------+----------------------------------|
| @5min   | 5   | < 5 min   | Quick email, file document       |
| @15min  | 1   | 15 min    | Review report, make call         |
| @30min  | 3   | 30 min    | Weekly review, planning          |
| @1hr    | 6   | 1 hour    | Deep work session                |
| @deep   | D   | Extended  | Major project work               |

** Tag Inheritance

Tags flow down the hierarchy:
#+BEGIN_EXAMPLE
* PROJECT Big Presentation :@work:project:
** NEXT Create outline :@high_energy:    # Inherits @work
** TODO Add graphics                      # Inherits @work  
#+END_EXAMPLE

** Tag Groups

Related tags are grouped:
- Work group: @work, @office, @computer, @phone
- Personal group: @personal, @home, @errands

* Capture Templates

** Basic Templates

*** Inbox (i)
Quick capture for processing later:
#+BEGIN_EXAMPLE
* TODO [cursor here]
  CAPTURED: [timestamp]
#+END_EXAMPLE

*** Task (t)
Context-aware task capture:
#+BEGIN_EXAMPLE
* TODO [cursor here] :@context:
  SCHEDULED: <today>
  CAPTURED: [timestamp]
#+END_EXAMPLE

*** Quick Note (n)
Instant capture, no confirmation:
#+BEGIN_EXAMPLE
* [cursor here] :note:
  CAPTURED: [timestamp]
#+END_EXAMPLE

*** Project (p)
Full project template:
#+BEGIN_EXAMPLE
* TODO Project Name [/] :@context:project:
  :PROPERTIES:
  :CATEGORY: development
  :EFFORT:   3d
  :END:
  CAPTURED: [timestamp]
  
  Description here
  
** TODO Define objectives
** TODO Create plan
** TODO Execute
#+END_EXAMPLE

** Advanced Templates

*** Meeting (m)
#+BEGIN_EXAMPLE
* MEETING Meeting Title :@work:meeting:
  SCHEDULED: <date time>
  :PROPERTIES:
  :ATTENDEES: names
  :LOCATION:  Conference Room
  :END:
  
  Agenda:
  - Item 1
  - Item 2
  
  Notes:
  
  Action Items:
  - [ ] Action 1
#+END_EXAMPLE

*** Interruption (x i)
With automatic clocking:
#+BEGIN_EXAMPLE
* INTERRUPTION [timestamp] :interruption:
  :PROPERTIES:
  :INTERRUPTED_BY: person
  :TASK_INTERRUPTED: [[previous task]]
  :DURATION: 10m
  :END:
  :CLOCK:
  [clocking data]
  :END:
#+END_EXAMPLE

*** Email Task (x e)
For email-based tasks:
#+BEGIN_EXAMPLE
* TODO Task from email :email:
  :PROPERTIES:
  :EMAIL_FROM: sender
  :EMAIL_SUBJECT: subject
  :EMAIL_DATE: date
  :END:
  
  [[email link]]
#+END_EXAMPLE

*** Habit (x h)
Recurring habits with tracking:
#+BEGIN_EXAMPLE
* TODO Habit Name
  SCHEDULED: <date .+1d>
  :PROPERTIES:
  :STYLE: habit
  :END:
#+END_EXAMPLE

** Template Selection Logic

The system selects templates based on:
1. Current context mode (work/personal/unified)
2. Capture key pressed
3. Additional prompts if needed

In unified mode, you get more options.
In focused modes, templates are context-specific.

* Agenda Views

** Dashboard Views

*** Work Dashboard (w)
Shows only work items:
- Today's schedule from work files
- Work NEXT actions
- Work WAITING items  
- Active work projects

*** Personal Dashboard (p)
Shows only personal items:
- Personal schedule
- Personal NEXT actions
- Personal WAITING items
- Personal projects

*** Unified Dashboard (u)
Complete view of everything:
- Combined schedule
- All NEXT actions grouped by context
- All WAITING items
- All active projects

** Specialized Views

*** Focus Mode (f)
Your top 3 NEXT actions:
- Sorted by priority
- Limited to 3 items
- For clarity and focus

*** Inbox Processing (i)
Special view for inbox:
- Shows only inbox items
- Sorted by capture time
- Easy bulk operations

*** Energy Views (e)
*Low Energy (e l)*:
- @low_energy tasks
- @routine tasks  
- @5min and @15min tasks

*High Energy (e h)*:
- @high_energy tasks
- @creative tasks
- @deep work

*** Project Overview (P)
All projects with:
- Completion status
- Next action count
- Sorted by context

*** Stalled Items (s)
Finds problems:
- TODOs with no recent activity
- Projects without NEXT actions
- Old WAITING items

** Agenda Commands

While in any agenda view:

*** Navigation
| Key | Action               |
|-----+----------------------|
| j/k | Move down/up         |
| J/K | Next/prev date       |
| g/G | Beginning/end        |
| ./,  | Today/yesterday      |
| f/b | Forward/back in time |

*** Task Management  
| Key | Action                 |
|-----+------------------------|
| t   | Cycle TODO state       |
| :   | Set tags               |
| s   | Schedule               |
| d   | Set deadline           |
| +/- | Change priority        |
| e   | Set effort             |
| R   | Refile                 |

*** View Control
| Key | Action            |
|-----+-------------------|
| v   | View dispatcher   |
| /   | Filter by tag     |
| <   | Filter by category|
| =   | Filter by regexp  |
| \   | Clear all filters |
| r/g | Refresh view      |

*** Bulk Operations
| Key | Action              |
|-----+---------------------|
| m   | Mark entry          |
| u   | Unmark entry        |
| U   | Unmark all          |
| B   | Bulk action menu    |
| B r | Bulk refile         |
| B s | Bulk schedule       |
| B + | Bulk set tag        |
| B - | Bulk remove tag     |

*** Clocking
| Key | Action            |
|-----+-------------------|
| I   | Clock in          |
| O   | Clock out         |
| X   | Cancel clock      |
| J   | Jump to clocked   |

* Processing Workflows

** Inbox Processing

The inbox is your capture point. Process it to zero regularly.

*** Processing Decision Tree
#+BEGIN_SRC ditaa
                     +-------------+
                     | Inbox Item  |
                     +-------------+
                            |
                            v
                    +--------------+
                    | Actionable?  |
                    +--------------+
                      /           \
                    Yes            No
                    /               \
                   v                 v
           +--------------+    +-----------+
           | 2 min rule? |    | Reference?|
           +--------------+    +-----------+
             /         \        /        \
           Yes          No    Yes         No
           /             \     |           \
          v               v    v            v
      +------+    +---------+ +-----+   +-------+
      | Do it|    |Delegate?| |File |   |Delete |
      +------+    +---------+ +-----+   +-------+
                    /     \
                  Yes      No
                  /         \
                 v           v
           +---------+  +---------+
           |WAITING  |  |TODO/NEXT|
           +---------+  +---------+
#+END_SRC

*** Quick Processing Mode

1. =SPC o o c x p= - Enter processing mode
2. Use quick keys:
   - =n= - Make NEXT action
   - =t= - Make TODO  
   - =p= - Convert to project
   - =s= - Make someday/maybe
   - =w= - Make WAITING
   - =d= - Delete
   - =r= - Refile interactively

*** Processing Best Practices

1. *Touch once*: Make a decision immediately
2. *2-minute rule*: If quick, do it now
3. *Context is king*: Always add context tags
4. *Projects need next*: Every project needs a NEXT
5. *Waiting needs who*: Track who you're waiting on

** Refile System

*** Refile Targets

The system automatically suggests targets:
- Work tasks → work/gtd.org
- Personal tasks → personal/gtd.org  
- Projects → appropriate projects.org
- Someday items → someday.org

*** Quick Refile

Use the refile hydra (=SPC o o r r=):
| Key | Destination        |
|-----+--------------------|
| w   | Work GTD           |
| p   | Personal GTD       |
| c   | Current clock      |
| W   | Work projects      |
| P   | Personal projects  |
| s   | Work someday       |
| S   | Personal someday   |
| a   | Archive            |
| i   | Interactive refile |

*** Smart Refile

The system can auto-detect based on tags:
- @work tagged → work files
- @personal tagged → personal files
- :project: tagged → projects.org
- SOMEDAY state → someday.org

** Review Workflows

*** Daily Review (5-10 minutes)

1. =SPC o o R d= - Open daily review
2. Review:
   - Today's accomplishments
   - Time tracking summary
   - Tomorrow's top 3
   - Energy assessment
3. Process inbox to zero
4. Set tomorrow's priorities

*** Weekly Review (30-60 minutes)

1. =SPC o o R w= - Open weekly review
2. Work through checklist:
   - ☐ Clear inbox completely
   - ☐ Review all action lists
   - ☐ Review all projects
   - ☐ Check waiting items
   - ☐ Scan someday/maybe
   - ☐ Review calendar (past/future)
   - ☐ Mind sweep for new items
   - ☐ Process notes
   - ☐ Set weekly priorities

3. Check each item with =C-c C-c=

*** Review Metrics

The system tracks:
- Inbox item count
- NEXT actions by context
- Project health (stalled/active)
- Waiting item age
- Task completion rate

* Time Management

** Clock System

*** Basic Clocking

Start timing any task:
1. Navigate to task
2. =SPC o o k i= to clock in
3. Work on task
4. =SPC o o k o= to clock out

The modeline shows current clocked time.

*** Clock Commands

| Command          | Key         | Purpose                    |
|------------------+-------------+----------------------------|
| Clock in         | I (agenda)  | Start timing               |
| Clock out        | O (agenda)  | Stop timing                |
| Clock cancel     | X (agenda)  | Cancel without saving      |
| Jump to clock    | J (agenda)  | Go to clocked task         |
| Clock display    | SPC o o k d | Show times in buffer       |
| Clock report     | SPC o o k r | Generate time report       |

*** Clock Reports

Generate with =SPC o o k r=:
#+BEGIN_EXAMPLE
#+BEGIN: clocktable :scope file :maxlevel 3
| Headline          | Time   |      |
|-------------------+--------+------|
| *Total time*      | *8:15* |      |
|-------------------+--------+------|
| Project Alpha     | 3:25   |      |
| \_  Research      |        | 1:15 |
| \_  Development   |        | 2:10 |
| Email and Admin   | 1:50   |      |
| Meetings          | 3:00   |      |
#+END:
#+END_EXAMPLE

** Effort Estimates

*** Setting Effort

On any task:
1. =SPC o o k e= or =e= in agenda
2. Choose from:
   - 0:15, 0:30, 1:00, 2:00
   - 3:00, 4:00, 5:00, 6:00, 8:00

### Effort in Agenda

Shows as [1:00] next to tasks:
#+BEGIN_EXAMPLE
TODO [1:00] Write project proposal
#+END_EXAMPLE

** Pomodoro Technique

*** Starting Pomodoro

1. Clock into a task
2. =SPC o o k p= - Start pomodoro
3. Work for 25 minutes
4. Break for 5 minutes
5. Repeat

### Pomodoro Settings

- Work: 25 minutes
- Short break: 5 minutes  
- Long break: 15 minutes (every 4 pomodoros)
- Notifications on state changes

### Pomodoro Tracking

Tasks show pomodoro count:
#+BEGIN_EXAMPLE
:PROPERTIES:
:POMODOROS: 3
:END:
#+END_EXAMPLE

* Advanced Features

** Batch Operations

*** In Agenda

Mark multiple items:
1. =m= to mark items (=u= to unmark)
2. =B= for bulk menu
3. Choose action:
   - =r= - Refile all
   - =s= - Schedule all
   - =d= - Set deadline
   - =+= - Add tag
   - =-= - Remove tag
   - =*= - Scatter (random scheduling)

*** Bulk Processing Functions

*Archive all DONE*:
- =SPC o o A d=
- Archives completed tasks

*Process by energy*:
1. Filter agenda by energy tag
2. Bulk schedule for appropriate time

*Smart bulk refile*:
- System detects context from tags
- Routes to appropriate file

** Mobile Capture

*** Setup

1. Configure sync directory (Dropbox, Syncthing, etc.)
2. Set =rk/mobile-inbox-dir= to sync location
3. Use mobile app to create inbox.org

### Processing Mobile Captures

1. =SPC o o x m= - Check for mobile items
2. Review and import each item
3. Or =C-c C-a= to import all

### Mobile Templates

Keep simple for mobile:
#+BEGIN_EXAMPLE
* TODO Task description
* Call John :@phone:
* Buy milk :@errands:
* Idea: New project concept
#+END_EXAMPLE

** Project Templates

*** Creating Projects

=SPC o o c p= provides template:
- Automatic structure
- Standard subtasks
- Metadata properties
- Progress tracking [/]

### Project Best Practices

1. *Clear outcome*: Define what "done" looks like
2. *Next action always*: Never leave without NEXT
3. *Regular reviews*: Check weekly for stalls
4. *Link resources*: Use org-roam for research

### Project Metadata

Track in properties:
#+BEGIN_EXAMPLE
:PROPERTIES:
:CATEGORY: development
:EFFORT:   5d
:DEADLINE: <2025-02-01>
:RESOURCES: [[file:notes.org]]
:END:
#+END_EXAMPLE

** Integration Features

*** Org-Roam Integration

*Create task from knowledge*:
1. In roam note: =SPC o o x r t=
2. Creates linked task
3. Bidirectional navigation

*Process actionable notes*:
1. Tag notes :actionable:
2. =SPC o o x r p= to process
3. Converts to tasks

*Link projects to knowledge*:
- Projects can reference roam nodes
- =ROAM_REFS= property for linking

*** Email Integration (Future)

When email integration is enabled:
- Capture from email client
- Link tasks to messages
- Track email-based waiting items

* Troubleshooting

** Common Problems

*** Files Not Found

*Symptom*: "Cannot find org file" errors

*Solution*:
1. Run =(rk/create-gtd-structure)=
2. Check =rk/org-directory= value
3. Verify permissions on directories

*** Empty Agenda Views  

*Symptom*: Agenda shows no items

*Solutions*:
- Check context mode (=SPC o o m m=)
- Refresh agenda (=r= or =g=)
- Verify =org-agenda-files=
- Check file has TODO items

*** Capture Not Working

*Symptom*: Capture templates fail

*Solutions*:
- Ensure in correct mode
- Check template configuration
- Verify target files exist
- Look for error in =*Messages*=

*** Refile Not Finding Targets

*Symptom*: No refile targets available

*Solutions*:
1. Rebuild cache: =C-0 C-c C-w=
2. Check =org-refile-targets=
3. Verify files in targets exist
4. Check outline depth settings

*** Clock Not Persisting

*Symptom*: Clock resets on restart

*Solutions*:
- Check =org-clock-persist= is =t=
- Verify clock save file exists
- Run =(org-clock-persistence-insinuate)=

** Performance Issues

*** Slow Agenda Generation

*Solutions*:
- Limit =org-agenda-files=
- Archive old completed items
- Use context modes to filter
- Increase =gc-cons-threshold= temporarily

*** Large File Performance

*Solutions*:
- Split into multiple files
- Archive aggressively
- Use =#+STARTUP: showeverything=
- Disable line numbers in org

** Configuration Issues

*** Changes Not Taking Effect

*Solutions*:
1. Tangle configuration: =SPC o o x t=
2. Reload: =SPC o o x r= 
3. Restart Spacemacs: =SPC q r=
4. Check for errors: =SPC b m= (*Messages*)

*** Finding Configuration

Key files:
- =~/dotspacemacs.org= - Main config
- =~/codelahoma-org.org= - GTD extensions
- =~/.spacemacs.d/init.el= - Generated file

** Getting Help

*** Built-in Help
- =SPC o o h= - GTD cheatsheet
- =SPC h d k= - Describe key
- =SPC h d f= - Describe function

*** Documentation
- This guide: =SPC o o g u=
- Tutorial: =SPC o o g t=
- Org manual: =SPC h i= → Org Mode

*** Debug Mode
#+BEGIN_SRC elisp
(setq debug-on-error t)
#+END_SRC

* Customization

** Changing Capture Templates

Edit in =codelahoma-org.org=:
#+BEGIN_SRC elisp
(add-to-list 'org-capture-templates
  '("x" "Custom" entry (file org-default-notes-file)
    "* TODO %?\n  %U\n  %a"))
#+END_SRC

** Adding Agenda Views

#+BEGIN_SRC elisp
(add-to-list 'org-agenda-custom-commands
  '("X" "Custom View"
    ((todo "NEXT" ((org-agenda-overriding-header "Custom Next"))))))
#+END_SRC

** Modifying Keywords

#+BEGIN_SRC elisp
(setq org-todo-keywords
      '((sequence "NEXT(n)" "TODO(t)" "WAITING(w)" "|" 
                  "DONE(d)" "CANCELLED(c)")))
#+END_SRC

** Custom Tags

#+BEGIN_SRC elisp
(setq org-tag-alist
      '(("@work" . ?w)
        ("@home" . ?h)
        ("CUSTOM" . ?x)))  ; Add your own
#+END_SRC

** Keybinding Changes

#+BEGIN_SRC elisp
(spacemacs/set-leader-keys
  "o o X" 'your-custom-function)
#+END_SRC

* Best Practices

** Capture Best Practices

1. *Capture immediately* - Don't trust memory
2. *One thought per item* - Split complex items
3. *Include context* - Where, when, why
4. *Use templates* - Consistency saves time
5. *Process regularly* - Don't let inbox grow

** Processing Best Practices

1. *Touch once* - Decide immediately
2. *2-minute rule* - Do quick tasks now
3. *Clarify outcome* - What does "done" mean?
4. *Add context tags* - Future you will thank you
5. *Batch similar items* - Process emails together

** Organization Best Practices

1. *Projects have next actions* - Always
2. *Waiting items have dates* - When to follow up
3. *Someday != never* - Review regularly
4. *Archive liberally* - Keep active lists clean
5. *One system* - Don't split attention

** Review Best Practices

1. *Weekly review is sacred* - Block the time
2. *Daily review is quick* - 5-10 minutes max
3. *Mind sweep completely* - Get it all out
4. *Update projects* - Add next actions
5. *Celebrate wins* - Acknowledge progress

** Engagement Best Practices  

1. *Context is king* - Work where you are
2. *Energy awareness* - Match task to state
3. *Time block deep work* - Protect focus time
4. *Batch small tasks* - Do @5min items together
5. *Trust the system* - Don't second-guess

* Appendices

** Complete Function Reference

*** Capture Functions
| Function                     | Purpose                      |
|------------------------------+------------------------------|
| org-capture                  | Open capture dispatcher      |
| rk/context-capture-task      | Smart context task capture   |
| rk/context-capture-project   | Smart context project        |
| rk/process-mobile-inbox      | Import mobile captures       |

*** Processing Functions
| Function                  | Purpose                         |
|---------------------------+---------------------------------|
| rk/process-inbox          | Interactive inbox processor     |
| rk/quick-tag              | Fast context tagging            |
| rk/quick-schedule         | Common scheduling options       |
| rk/auto-refile-by-context | Smart refile by tags            |
| rk/finish-inbox-processing| Complete processing session     |

*** Review Functions
| Function              | Purpose                           |
|-----------------------+-----------------------------------|
| rk/weekly-review      | Comprehensive weekly review       |
| rk/daily-review       | Quick daily review                |
| rk/morning-planning   | Morning startup routine           |
| rk/evening-shutdown   | Evening completion routine        |

*** Organization Functions
| Function                    | Purpose                       |
|-----------------------------+-------------------------------|
| rk/create-gtd-structure     | Initialize file structure     |
| rk/validate-gtd-structure   | Check all files exist         |
| org-work-mode               | Switch to work context        |
| org-personal-mode           | Switch to personal context    |
| org-unified-mode            | Switch to unified view        |

*** Archive Functions
| Function               | Purpose                         |
|------------------------+---------------------------------|
| rk/archive-done-tasks  | Archive all completed           |
| rk/archive-old-tasks   | Archive 30+ day old tasks       |
| rk/validate-archive    | Check archive integrity         |

** Configuration Variables

*** File Locations
| Variable           | Purpose                  | Default                  |
|--------------------+--------------------------+--------------------------|
| rk/org-directory   | Base org directory       | ~/personal/org-files     |
| org-default-notes-file | Inbox location      | (rk/org-file "inbox.org") |
| org-archive-location | Archive destination    | archive.org::* From %s   |

*** Behavior Settings
| Variable                    | Purpose                    | Default |
|-----------------------------+----------------------------+---------|
| org-refile-targets          | Where items can be refiled | Complex |
| org-agenda-files            | Files included in agenda   | Dynamic |
| org-capture-templates       | Available capture types    | Many    |
| org-agenda-custom-commands  | Custom agenda views        | Many    |

*** Display Settings
| Variable                     | Purpose                | Default    |
|------------------------------+------------------------+------------|
| org-agenda-window-setup      | How agenda appears     | current    |
| org-agenda-span              | Days shown in agenda   | day        |
| org-agenda-start-with-log    | Show clocking on start | nil        |
| org-log-into-drawer          | Where to log changes   | t          |

** File Format Reference

*** Task Format
#+BEGIN_EXAMPLE
* TODO Task description :tag1:tag2:
  SCHEDULED: <2025-01-15 Wed>
  DEADLINE: <2025-01-20 Mon>
  :PROPERTIES:
  :EFFORT:   1:00
  :CATEGORY: project-name
  :END:
  
  Task notes and details here.
  
  - [ ] Subtask 1
  - [ ] Subtask 2
#+END_EXAMPLE

*** Project Format
#+BEGIN_EXAMPLE
* TODO Project Name [2/4] :project:@work:
  :PROPERTIES:
  :CATEGORY: development
  :CREATED:  [2025-01-09]
  :END:
  
  Project description and goals.
  
** DONE Define requirements
   CLOSED: [2025-01-10 Fri 14:30]
** NEXT Create implementation plan  
** TODO Implement core features
** TODO Test and deploy
#+END_EXAMPLE

*** Archive Entry
#+BEGIN_EXAMPLE
* DONE Completed task
  CLOSED: [2025-01-09 Thu 16:45]
  :PROPERTIES:
  :ARCHIVE_TIME: [2025-01-09 Thu 16:50]
  :ARCHIVE_FILE: ~/org/work/gtd.org
  :ARCHIVE_CATEGORY: work
  :END:
#+END_EXAMPLE

* Quick Start Checklist

For new users, complete these steps in order:

** Initial Setup
- [ ] Run =(rk/create-gtd-structure)= to create files
- [ ] Test capture with =SPC o o c i=
- [ ] View agenda with =SPC o o a u=
- [ ] Practice changing TODO states

** First Week
- [ ] Capture everything to inbox
- [ ] Process inbox daily
- [ ] Try different agenda views
- [ ] Complete your first weekly review

** First Month  
- [ ] Develop capture habits
- [ ] Customize templates for your needs
- [ ] Start using context tags effectively
- [ ] Track time on some tasks

** Ongoing
- [ ] Weekly reviews every week
- [ ] Refine your contexts
- [ ] Archive completed items
- [ ] Optimize for your workflow

---

Remember: The goal is not perfection, but trusted systematic action. Let the system work for you!